import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:qareeb_dash/core/extensions/extensions.dart';
import 'package:qareeb_dash/core/widgets/my_button.dart';
import 'package:qareeb_dash/core/widgets/my_text_form_widget.dart';
import 'package:qareeb_models/extensions.dart';

import '../../../../core/util/my_style.dart';
import '../../bloc/create_policy_cubit/policy_cubit.dart';
import '../../bloc/policy_cubit/create_policy_cubit.dart';

class PrivacyPolicyPage extends StatefulWidget {
  const PrivacyPolicyPage({Key? key}) : super(key: key);

  @override
  State<PrivacyPolicyPage> createState() => _PrivacyPolicyPageState();
}

class _PrivacyPolicyPageState extends State<PrivacyPolicyPage> {
  @override
  Widget build(BuildContext context) {
    var policy = '';
    return Scaffold(
      body: BlocListener<CreatePolicyCubit, CreatePolicyInitial>(
        listenWhen: (p, c) => c.statuses.done,
        listener: (context, state) {
          context.read<PolicyCubit>().getPolicy(context);
        },
        child: BlocBuilder<PolicyCubit, PolicyInitial>(builder: (_, state) {
          if (state.statuses.isLoading) {
            return MyStyle.loadingWidget();
          }
          return Center(
            child: Column(
              mainAxisSize: MainAxisSize.min,
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                SizedBox(
                  height: 300.h,
                  child: MyEditTextWidget(
                    initialValue: state.result.policy,
                    onChanged: (p0) => policy = p0,
                    maxLines: 20000,
                    maxLength: 1.0.maxInt,
                    innerPadding: const EdgeInsets.all(20.0).r,
                  ),
                ),
                BlocBuilder<CreatePolicyCubit, CreatePolicyInitial>(
                  builder: (context, state) {
                    if (state.statuses.isLoading) {
                      return MyStyle.loadingWidget();
                    }
                    return MyButton(
                      onTap: () async {
                        context
                            .read<CreatePolicyCubit>()
                            .createPolicy(context, policy: policy);
                      },
                      text: 'تحديث',
                    );
                  },
                )
              ],
            ),
          );
        }),
      ),
    );
  }
}
/*
سياسة الخصوصية وشروط الاستخدام لتطبيق قريب
شركة المبتكرون الأوائل محدودة المسؤولية س.ت: 10973 (“نحن"، "الخاص بنا" أو "لنا") ملتزمة بحماية خصوصية بيانات كل مستخدمين موقعنا https://qareeb-maas.com/ أو تطبيق الهاتف المحمول الخاص بنا. يرجى قراءة سياسة الخصوصية وشروط الاستخدام التالية والتي توضح كيف نستعمل ونحمي معلوماتك. سنكون المتحكمين بالبيانات التي تقدمها لنا.
________________________________________
التعريف بعمل التطبيق: هي خدمة مدعومة من قبل خدمة الأثر موجهة لتنظيم نقل الركاب باستخدام التطبيقات الالكترونية والتطبيق هو لاستخدام الوسائل الالكترونية والتطبيقات في عملية حجز واستخدام خدمات نقل الركاب.
الجهة المسؤولة عن تشغيل التطبيق: شركة المبتكرون الأوائل محدودة المسؤولية سجل تجاري 10973 ريف دمشق – دمشق شارع العابد بناء دعبول طابق ثاني هاتف 011-2322014 صندوق بريد 8031 وهو مستضاف لدى الشركة السورية للامداد التقني محدودة المسؤولية – مزود انترنت ليما
الفئات المستهدفة لاستخدام التطبيق : يستهدف التطبيق جميع الفئات القادرة على استخدام وسائل النقل العامة وجميع اصحاب السيارات الخاصة والتي لا يتجاوز عدد مقاعدها 10 مقاعد الراغبين بان يقدمو خدماتهم بنقل الركاب من خلال التطبيق الالكتروني "قريب"
توصيف عمل التطبيق: الهدف من التطبيق هو تقديم تجربة مميزة من خلال ربط المستخدمين بالسائقين حيث يعمل قريب كوسيط وبالنيابة عن السائقين للوصول الى المستخدمين الذين يحتاجون الى وسيلة نقل حسب احتياجاتهم ويعمل قريب على ادارة العلاقة بين العملاء من خلال اتمتة ومتابعة عملية الطلبات للنقل التي يحصل عليها من المستخدمين وتقديم خدمات ما بعد تقديم الخدمة للوصول الى اعلى مستوى من جودة الخدمات الالكترونية والخدمات عبر الانترنت.
•	انشاء الحساب: قبل ان تتمكن من إرسال الطلبات ، ستحتاج إلى إنشاء حساب " قريب " من خلال رقم هاتفك ، و بإمكانك إغلاق هذا الحساب في أي وقت عن طريق التطبيق وحذف التطبيق من هاتفك .يحق لنا حجب وصولك إلى حسابك أو إغلاقه إذ رأينا أنك تسيء استخدام خدماتنا ، على سبيل المثال (عدم إتمام طلبك ، تقديم شكاوى غير منطقية ، إساءة معاملة موظفينا ، التشهير بسمعة الشركة دون وجه حق ، أو أي سبب وجيه آخر)
•	توافر الخدمة: لكل خدمة مناطق توصيل محددة وقد تتغير مناطق التوصيل هذه في أي وقت بسبب عوامل متعددة مثل الطقس ، أو الطلب المتزايد على خدمتنا ، وذلك بغية الحفاظ على جودة الخدمة، يقرر كل سائق مشترك ساعات العمل الخاصة به ، وهذا يعني أن توفر خدمتنا يعتمد على السائقين المشتركين، في حال قيامك بمحاولة الطلب من منطقة خارج نطاق التوصيل المعتمد لدينا ، أو خارج أوقات العمل ، أو لم تكن الخدمة متاحة لأي سبب آخر ، سنقوم بإعلامك بأن طلبك لن يكون ممكناً.
•	آلية الطلب على تطبيق قريب: عند إرسالك للطلب ، سيكون الطلب بحاجة لقبوله من قبلنا ومن قبل السائقين  وبالتالي عند قبول الطلب سيتم ارسال الاشعار الذي يعلمك بقبول الطلب ومعلومات السائق الذي قبل الطلب، وبالتالي باللحظة التي يتم قبول الطلب فيها اصبحت ملزم بهذه الشروط وأنت مسؤول عن دفع كامل قيمة فاتورتك التي تظهر على الشاشة حتى في حال قيامك بالطلب نيابة عن شخص آخر  قد لا نستطيع تنفيذ كافة الملاحظات المذكورة من قبلك على الطللب والحد الأدنى لطلب التوصيل هو 1000 متر بين نقطة الانطلاق و الهدف وقبل إرسال طلبك يمكنك اختيار وقت التوصيل : إما فوري أو لاحق بالنسبة للطلبات الفورية ، سنقوم بإعلامك بالوقت المتوقع لوصول السائق قبل إرسال الطلب ،لكن الوقت الفعلي يظهر عند تثبيت طلبك مع السائق ، لذا يجب أن تكون جاهزاً عند وصول السائق اما بالنسبة . للطلبات اللاحقة ، سنقوم بتثبيت طلبك قبل 35 أو 40 دقيقة من موعد رحلتك ، وفي حال عدم وجود أي سائق متاح سيتم رفض الطلب لسوء الحظ ، وعلى الرغم من الجهود التي نبذلها ، و كذلك جهود السائقين المشاركين ، لا تسير الأمور دائماً للتخطيط ، وقد تمنعنا بعض العوامل مثل حركة المرور و أحوال الطقس من تلبية طلبك في الوقت المحدد، ففي حال تأخر طلبك عن الوقت المتوقع لأكثر من 10 دقائق ، سيتم خصم 20% من قيمة رحلتك ، إلا إذا كنت أنت المتسبب في التأخير ( على سبيل المثال : أعطيتنا عنواناً خاطئاً ، أو لم تقم بالحضور لدى وصول الساىق إليك).
•	حقوق المستخدم وآلية التعامل في حال حدوث خطأ ما: لديك الحق في إلغاء الطلب دون أي غرامات في حال وصول السائق بعد الوقت المحدد ب 10 دقائق  كما سنقوم بتعويضك بقيمة الرحلة في حال كان تعامل السائق أو مواصفات السيارة تحت الحد الأدنى المقبول بحسب الخدمة المطلوبة فيرجى تقديم شكوى خلال 24 ساعة عبر إرسالها عن طريق التطبيق او التواصل مع الشركة على ارقام خدمة الزبائن متضمنة المشكلة التي تعرضت لها وقبل إجراء عملية التعويض ، قد نقوم بأخذ العوامل المختلفة بعين الاعتبار، كمعلومات الطلب وطلباتك السابقة ،بالإضافة إلى  معلومات إضافية من قبل السائقين المشاركين .
•	الغاء الطلب: في حال قمت بإالغاء الطلب سيتم فرض غرامة محددة الخدمة المقدمة وفق ما يلي :
o	عند إلغاء الطلب قبل 15 دقيقة من وقت وصول السائق .
o	عند الحضور بعد الوقت المحدد ب 10 دقائق و عدم الإجابة على هاتفك لدى اتصالنا بك على أرقام التواصل المقدمة من قبلك سيتم إلغاء الرحلة مع فرض غرامة متضمنة وقت الانتظار.
آلية الغرامة يتم فرض غرامة يتم تحصيلها منك في الرحلة القادمة او اغلاق الحساب .
•	الاسعار والدفع والعروض:  إن السعر المعروض على الشاشة قبل إرسال الطلب هو سعر تقريبي ، أما السعر الفعلي فهو مبني على عداد الوقت و المسافة اللذان يتم احتسابهما بواسطة تطبيق السائق لكل خدمة مدة انتظار مجانية معينة ، فعند وصول السائق إلى نقطة الانطلاق المحددة من قبل الزبون يتم تنبيه الزبون عن طريق الوسيلة المفضلة لديه (رسالة نصية – رسالة واتساب – إشعارات على التطبيق ) و يبدأ عداد الانتظار بالعمل وعند صعود الزبون إلى السيارة يقوم الكابتن (السائق ) بتشغيل العداد عن طريق التطبيق ويتم تنبيه الزبون بذلك ايضاً يبدأ عداد الوقت بالعمل و احتساب عدد الكيلومترات عن طريق إحداثيات الموقع ومن خلال التكامل بين اجهزة تتبع المركبات المربوطة مع تطبيق قريب المقدمة من خدمة أثر لتتبع وملاحقة الآليات وعند انتهاء الرحلة تصل للزبون رسالة بتفاصيل الرحلة و تكاليفها كاملة وفي حال كان هناك خطأ في التسعير يمكنك الإبلاغ عن المشكلة التي تعرضت لها عن طريق التطبيق حيث يتم معالجة المشاكل المرسلة من قبل خدمة العملاء باستخدام المعلومات المتاحة ( إحداثيات الرحلة – نقطة الانطلاق - نقطة الهدف – تفاصيل العنوان المزودة من قبل الزبون ) وفي حال كان هناك خطأ أو سوء استخدام للتطبيق من قبل السائق فسيتم تعويضك عن طريق قسيمة حسم بإمكانك استخدامها في الرحلات القادمة يتوجب تسديد كامل فاتورتك نقداً للسائق عند انهاء الرحلة  او من خلال الوسائل الالكترونية في حال توافرها على التطبيق ويقوم "قريب" بتقديم عروض و حسومات بشكل مستمر ، و ستصلك معلومات الحسم ومدة فعاليته في رسالة.
•	موقعنا و خدماتنا تتغير بانتظام :نحن نهدف إلى تحديث موقعنا و خدماتنا بانتظام ، وقد نقوم بتغيير المحتوى في أي وقت . وإذا دعت الحاجة فقد نعلق الوصول إلى موقعنا و خدماتنا أو نغلقها إلى أجل غير مسمى قد تكون أي من المواد الموجودة على موقعنا أو خدماتنا قديمة في وقت معين ، ونحن لسنا ملزمين بتحديث المواد .
•	طلبات وهمية :في حال تجاهلك لطلب لأسباب تتعلق بك فقط أو عدم ردك على السائق ، سيتم اعتبار الطلب مزيفاً و إلغاء الطلب من قبلنا ، ما سيقودنا إلى حظر رقمك ، أي أنك لن تكون قادراً على إجراء أي طلبات جديدة من خلال حسابك حتى تقوم بتصفية الذمة المالية المستحقة على حسابك ، والتي تبلغ 50% من قيمة الرحلة المتوقعة.
•	الإبلاغات :تتم معالجة جميع الإبلاغات خلال خمسة أيام من العملية في حال عدم معالجة مشكلة ما خلال هذه الفترة ، الرجاء إرسال إبلاغ آخر و تحديد رقم الشكوى التي لم تتم معالجتها بعد. في حال لم تكن راضياً عن خدمة العملاء في معالجة إبلاغ معين ، يمكنك إرسال إبلاغ جديد و تحديد رقم الشكوى ليتم مراجعتها من قبل الإدارة .الحد الأقصى لمعالجة أي مشكلة تتعلق بالسعر أو أي خدمة أخرى هو أسبوع بعد انتهاء الرحلة .قد لا تتم معالجة الشكوى لرحلات تجاوزت مدتها الحد الأقصى كما يمكنك مراجعة الهيئة الناظمة لقطاع الاتصالات الجهة المرخصة لتطبيق قريب في حال لم تحصل على حقك في معالجة الشكوى المقدمة من قبلك.
بيانات المتصل: إذا كان لديك أي استفسارات أو طلبات بخصوص سياسة الخصوصية هذه أو كيف نتعامل مع بياناتك بشكل عام، يرجى الاتصال بنا باستخدام التفاصيل التالية: عبر الهاتف على الرقم: 0112322014 أو عن طريق الايميل: privacy@qareeb-maas.com
كيف نقوم بجمع معلوماتك: نقوم بجمع معلوماتك الشخصية عندما تتفاعل معنا أو تستخدم خدماتنا، مثلا عندما تستخدم مواقعنا لإرسال طلب. وننظر أيضا في كيفية استخدام الزوار لمواقعنا، لمساعدتنا على تحسين خدماتنا وتحسين تجربة العملاء.
نقوم بجمع المعلومات:
•	عند إنشاء حساب معنا أو تغيير إعدادات حسابك.
•	عند إرسال طلب إلينا وأثناء عملية الطلب (بما في ذلك إنشاء وإنهاء الطلب).
•	عند الاتصال بنا مباشرة عبر البريد الإلكتروني أو الهاتف أو الرسالة أو عبر وظيفة تواصل معنا.
المعلومات التي نجمعها عنك: كجزء من التزامنا بخصوصية عملائنا وزائري مواقعنا بشكل عام، نريد أن نكون واضحين بشأن أنواع المعلومات التي سنجمعها منك. عند إرسال طلب من خلال منصة قريب لأول مرة يطلب منك تقديم معلومات عن نفسك بما في ذلك اسمك وتفاصيل الاتصال وموقعك الجغرافي والوجهة التي ترغب بالوصول إليها. نجمع أيضا معلومات حول استخدامك للعناوين، ومعلومات عنك من أي رسائل ترسلها الينا أو عند الاتصال بنا أو تزويدنا بتعليقات، بما في ذلك عبر البريد الالكتروني أو الهاتف. إذا اتصلت بنا عبر الهاتف، فسوف نسجل المكالمة لأغراض التدريب وتحسين الخدمة، ونقوم بتدوين ملاحظات فيما يتعلق بالمكالمة. نقوم بجمع معلومات فنية من جهازك المحمول او جهاز الحاسب الخاص بك، مثل نظام التشغيل الخاص به، والجهاز ونوعه ونوع الاتصال وعنوان IP الذي تدخل منه الى مواقعنا.
استخدام المعلومات الخاصة بك: سنقوم بمعالجة البيانات التي نجمعها عنك فقط إذا كان هناك سبب للقيام بذلك، وإذا كان هذا السبب مسموحاً به بموجب المرسوم التشريعي رقم 17 لعام 2012 ضمن قانون تنظيم التواصل على الشبكة ومكافحة الجريمة المعلوماتية. سيكون لدينا أساس قانوني لمعالجة المعلومات الخاصة بك؛ إذا كنا بحاجة إلى معالجة المعلومات الخاصة بك من أجل تزويدك بالخدمة التي طلبتها أو للدخول في عقد فلدينا موافقتك ولدينا سبب مبرر لمعالجة بياناتك، أو نحن ملزمون قانونا بالقيام بذلك. حيثما نحتاج لتزويدك بالخدمة التي طلبتها أو للدخول في عقد فإننا نستخدم معلوماتك:
•	لتمكيننا من تزويدك بالوصول الى الأجزاء ذات الصلة بالمنصة.
•	لتوفير الخدمات التي طلبتها.
•	لتمكيننا من تحصيل المدفوعات منك.
•	للاتصال بك عند الضرورة فيما يتعلق بخدماتنا، مثل حل المشكلات التي قد تواجهنا في طلبك.
نقوم أيضا بمعالجة بياناتك حيث يكون لدينا سبب مبرر للقيام بذلك، على سبيل المثال تخصيص خدماتنا، بما في ذلك معالجة البيانات لجعل الأمر أسهل وأسرع بالنسبة لك لتقديم الطلبات. أدرجنا هذه الأسباب أدناه:
•	تحسين فعالية وجودة الخدمة التي يتوقعها عملاؤنا منا في المستقبل.
•	لتخصيص المحتوى الذي نعرضه لك، نحن أو أي جهة مشتركة معنا أو شركاء الإعلان.
•	لتمكين فريق دعم العملاء لدينا من مساعدتك في أي استفسارات أو شكاوى بأكثر الطرق فعالية ممكنة ولتقديم تجربة إيجابية للعملاء.
•	للاتصال بك والاطلاع على آرائك وملاحظاتك على خدماتنا وإبلاغك إذا كانت هناك اي تغييرات أو تطورات مهمة على المواقع أو خدماتنا، بما في ذلك إعلامك بأن خدماتنا تعمل في منطقة جديدة، في حال كنت قد طلبت منا فعل ذلك.
•	لإرسال معلومات إليك عن منتجاتنا وخدماتنا وعروضنا الترويجية.
•	لتحليل نشاطك على المواقع حتى نتمكن من إدارة ودعم وتحسين وتطوير أعمالنا لأغراض إحصائية وتحليلية ولمساعدتنا على منع الاحتيال.
•	لفرض شروطنا التعاقدية معك وأي اتفاقية أخرى، ولممارسة أو الدفاع عن المطالبات القانونية وحماية حقوقنا أو الجهات الشريكة معنا أو مقدمي خدمات التوصيل أو غيرهم، بما في ذلك منع الاحتيال.
•	إذا قدمت تعليقات بشأن المواقع والخدمات، فقد نستخدم هذه التعليقات في أي مواد تسويقية أو إعلانية. سوف نحدد هويتك لهذا الغرض فقط باسمك الأول والمدينة التي تعيش فيها.
•	في حال اخترت تلقي إعلانات من خلال تطبيق الهاتف المحمول الخاص بنا فسنرسل إليك إعلانات متعلقة بالخدمات التي طلبتها منا ومعلومات حول خدماتنا وعروضنا.
سنقوم أيضا بتحليل البيانات المتعلقة باستخدامك لخدماتنا من بيانات موقعك لإنشاء ملفات تعريفية متعلقة بك ولك. هذا يعني أننا قد نضع بعض الافتراضات حول ما قد تهتم به ونستخدمه، لنرسل لك المزيد من الاتصالات التسويقية المصممة خصيصا لك، أو لإعلامك بالعروض الخاصة أو المنتجات التي نعتقد أنك قد تكون مهتما بها. يشار إلى هذا النشاط باسم التنميط. لديك حقوق معينة فيما يتعلق بهذا النوع من المعالجة. الرجاء مراجعة قسم "حقوقك" أدناه لمزيد من المعلومات.
عندما نكون ملزمين قانونيا بالقيام بذلك، يجوز لنا استخدام معلوماتك من أجل:
•	إنشاء سجل لطلبك.
•	الامتثال لأي التزام قانوني أو شروط تنظيمية نتعرض له.
التسويق المباشر: في حال منحنا موافقتك أو عندما يكون لدينا سبب مبرر للقيام بذلك، سنستخدم معلوماتك لإعلامك بمنتجاتنا وخدماتنا الأخرى التي قد تهمك عن طريق البريد الإلكتروني أو الهاتف. يمكنك التحكم في تفضيلات التسويق عبر البريد الإلكتروني الخاصة بك من خلال:
•	تطبيق الهاتف المحمول
•	أو موقعنا على شبكة الإنترنت https://qareeb-maas.com.
الاحتفاظ بمعلوماتك: لن نحتفظ بمعلوماتك لفترة أطول مما نعتقد أنه ضروري. سيتم الاحتفاظ بالمعلومات التي نجمعها ما دامت هناك حاجة للوفاء بالأغراض الموضحة في قسم "استخدام المعلومات الخاصة بك" أعلاه بما يتماشى مع مصلحتنا المشروعة أو لفترة تشترطها على وجه التحديد اللوائح أو القوانين المعمول بها، مثل الحفاظ على المعلومات لأغراض التقارير التنظيمية.

عند تحديد فترات الاستبقاء ذات الصلة، سنأخذ في الاعتبار العوامل التالية:
•	التزاماتنا وحقوقنا التعاقدية فيما يتعلق بالمعلومات المعنية.
•	التزامات قانونية بموجب القانون المعمول به بالاحتفاظ بالبيانات لفترة زمنية معينة.
•	المنازعات المحتملة.
•	إرشادات صادرة عن الهيئة الوطنية لخدمات الشبكة والهيئات الحكومية ذات الصلة.
بخلاف ذلك، نقوم بمسح معلوماتك بشكل آمن حيث لم نعد نحتاج الى معلوماتك للأغراض التي تم جمعها.
الكشف عن معلوماتك: سيتم نقل المعلومات التي نجمعها عنك وتخزينها على خوادمنا الموجودة داخل الجمهورية العربية السورية. نحن حريصون وشفافون للغاية بشأن من تتم مشاركة معلوماتك معه. نحن نشارك معلوماتك مع مزودي خدمة الطرف الثالث. تشمل أنواع مزودي خدمة الجهات الخارجية الذين نشاركهم معلوماتك معهم:
•	الجهات الشريكة: نقوم بتزويد الجهات الشريكة بمعلوماتك عند قيامك بطلب التنبيهات منهم حتى يتمكنوا من تلبية طلبك، أو لحل المشاكل أو تحسين خدماتهم.
•	مخدمي التوصيل: حتى يتمكنوا من توصيلك.
•	موظفي قسم خدمة العملاء: من سيساعدنا على حل أي مشكلات قد تواجهك في خدماتنا.
•	شركاء التسويق والإعلان: حتى يتمكنوا من التأكد من أنك ترى الإعلان الأكثر صلة بك ويرسلوا إليك البريد الالكتروني والتسويق البريدي نيابة عنا.
ستتخذ الشركة جميع الخطوات اللازمة بشكل معقول لضمان التعامل مع بياناتك بشكل آمن ووفقا لسياسة الخصوصية هذه عند نقلها الى جهات خارجية. إذا دخل نشاطنا التجاري في مشروع مشترك مع كيان تجاري آخر أو تم شراؤه أو بيعه مع كيان تجاري آخر، فقد يتم الكشف عن معلوماتك أو نقلها الى الشركة المستهدفة أو شركاء أعمالنا الجدد أو مالكيها أو مستشاريهم.
قد نشارك أيضا معلوماتك:
•	إذا كنا ملزمين بالكشف عن معلوماتك أو مشاركتها من أجل الامتثال (و/ أو عندما نعتقد أننا ملزمون بالامتثال) لأي التزام قانوني أو أمر قضائي أو شرط تنظيمي. يتضمن ذلك تبادل المعلومات مع الشركات الأخرى والمؤسسات الأخرى لأغراض الحماية من الاحتيال والوقاية منه.
•	من أجل إنفاذ شروطنا التعاقدية معك وأي اتفاقية أخرى.
•	لحماية حقوق الشركة أو الجهات الشريكة أو مقدمي خدمات التوصيل أو غيرهم، بما في ذلك منع الاحتيال.
•	ومع الأطراف الثالثة التي نعتبرها ضرورية بشكل معقول من أجل منع الجريمة، على سبيل المثال الضابطة العدلية.
حقوقك: بموجب قانون تنظيم التواصل على الشبكة ومكافحة الجريمة المعلوماتية، قد يكون لديك عدد من الحقوق المتعلقة بالبيانات التي نحتفظ بها عنك. إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى الاتصال بمسؤول حماية البيانات لدينا باستخدام تفاصيل الاتصال المذكورة أعلاه. للحصول على معلومات إضافية حول حقوقك يرجى مراجعة المرسوم التشريعي رقم 17 لعام 2012 والمتضمن قانون تنظيم التواصل على الشبكة ومكافحة الجريمة المعلوماتية.
التغييرات في سياسة الخصوصية لدينا وتعديلها: سيتم نشر أي تغييرات تطرأ على سياسة الخصوصية الخاصة بنا على مواقعنا، عند الاقتضاء، سوف نخبرك بالتغييرات على سبيل المثال عن طريق البريد الالكتروني، أو باقي وسائل التواصل الاجتماعي وعبر خدمة العملاء.
الشكاوى: إذا لم تكن راضيا عن ردنا على أي شكوى أو تعتقد أن معالجتنا لمعلوماتك لا تتوافق مع قانون تنظيم التواصل على الشبكة ومكافحة الجريمة المعلوماتية، يمكنك تقديم شكوى الى مكتب امن المعلومات باستخدام التفاصيل التالية: رقم الهاتف: 0112322014 عنوان البريد الالكتروني:
privacy@qareeb-maas.com


 */